Repository: lwd-temp/photoprism
Catalog: frontend/src/locales/*.po
Languages: ga, th

source: Reloading…
ga: Á athlódáil…
th: กำลังโหลดซ้ำ…

source: Remote Sync
ga: Sync Cianda
th: ซิงค์ระยะไกล

source: Remove
ga: Bain
th: ลบ

source: remove failed: unknown album
ga: bhaint theip: albam anaithnid
th: การลบล้มเหลว: อัลบั้มที่ไม่รู้จัก

source: Remove from album
ga: Bain as an albam
th: นำออกจากอัลบั้ม

source: Remove imported files to save storage. Unsupported file types will never be deleted, they remain in their current location.
ga: Bain comhaid iompórtáilte chun stóras a shábháil. Ní scriosfar cineálacha comhaid nach dtacaítear leo go deo, fanann siad ina suíomh reatha.
th: ลบไฟล์ที่นำเข้าเพื่อประหยัดพื้นที่จัดเก็บ ประเภทไฟล์ที่ไม่รองรับจะไม่ถูกลบ โดยจะยังคงอยู่ในตำแหน่งปัจจุบัน

source: Request failed - are you offline?
ga: Theip ar an iarratas - an bhfuil tú as líne?
th: คำขอล้มเหลว - คุณออฟไลน์อยู่หรือไม่

source: Request failed - invalid response
ga: Theip ar an iarratas - freagra neamhbhailí
th: คำขอล้มเหลว - ตอบกลับไม่ถูกต้อง

source: Require non-photographic and low-quality images to be reviewed before they appear in search results.
ga: A éileamh go ndéanfaí athbhreithniú ar íomhánna neamh-ghrianghrafadóireachta agus ar cháilíocht íseal sula dtaispeánfar iad i dtorthaí cuardaigh.
th: กำหนดให้ต้องตรวจสอบรูปภาพที่ไม่ใช่ภาพถ่ายและคุณภาพต่ำก่อนที่จะปรากฏในผลการค้นหา

source: Required
ga: Ag teastáil
th: ที่จำเป็น

source: Resolution
ga: Rún
th: ปณิธาน

source: Restart
ga: Atosaigh
th: เริ่มต้นใหม่

source: Restore
ga: Athchóirigh
th: คืนค่า

source: Retry Limit
ga: Atriail Teorainn
th: ขีดจำกัดการลองใหม่

source: Retype Password
ga: Athchlóscríobh Pasfhocal
th: พิมพ์รหัสผ่านอีกครั้ง

source: Review
ga: Léirmheas
th: ทบทวน

source: Role
ga: Ról
th: บทบาท

source: Rows per page:
ga: Sraitheanna in aghaidh an leathanaigh:
th: จำนวนแถวต่อหน้า:

source: Satellite
ga: Satailít
th: ดาวเทียม

source: Save
ga: Sábháil
th: บันทึก

source: Scan
ga: Scanadh
th: สแกน

source: Scan the QR code with your authenticator app or use the setup key shown below and then enter the generated verification code:
ga: Scan an cód QR le d'aip fíordheimhnitheora nó bain úsáid as an eochair socraithe a thaispeántar thíos agus ansin cuir isteach an cód fíoraithe ginte:
th: สแกนโค้ด QR ด้วยแอปยืนยันตัวตนของคุณ หรือใช้คีย์การตั้งค่าที่แสดงด้านล่าง จากนั้นป้อนรหัสยืนยันที่สร้างขึ้น:

source: Scans
ga: Scananna
th: สแกน

source: Scope
ga: Raon feidhme
th: ขอบเขต

source: Search
ga: Cuardach
th: ค้นหา

source: Search and display photos on a map.
ga: Cuardaigh agus taispeáin grianghraif ar léarscáil.
th: ค้นหาและแสดงภาพถ่ายบนแผนที่

source: Season
ga: Séasúr
th: ฤดูกาล

source: Secret
ga: Rúnda
th: ความลับ

source: Security and Access
ga: Slándáil agus Rochtain
th: ความปลอดภัยและการเข้าถึง

source: Select
ga: Roghnaigh
th: เลือก

source: Select a source folder to import files…
ga: Roghnaigh fillteán foinse chun comhaid a iompórtáil…
th: เลือกโฟลเดอร์ต้นทางที่จะนำเข้าไฟล์…

source: Select date
ga: Roghnaigh dáta
th: เลือกวันที่

source: Select dates
ga: Roghnaigh dátaí
th: เลือกวันที่

source: Select or create an album
ga: Roghnaigh nó cruthaigh albam
th: เลือกหรือสร้างอัลบั้ม

source: Select the files to upload…
ga: Roghnaigh na comhaid le huaslódáil…
th: เลือกไฟล์ที่จะอัพโหลด…

source: Select the folder to be indexed…
ga: Roghnaigh an fillteán atá le hinnéacsú…
th: เลือกโฟลเดอร์ที่จะสร้างดัชนี…

source: Select Time
ga: Roghnaigh Am
th: เลือกเวลา

source: Selection approved
ga: Faomhadh an roghnúcháin
th: อนุมัติการคัดเลือก

source: Selection archived
ga: Roghnaithe sa chartlann
th: การเลือกที่เก็บถาวร

source: Selection restored
ga: Athchóiríodh an roghnúchán
th: คืนค่าการเลือกแล้ว

source: Send
ga: Seol
th: ส่ง

source: Sequential Name
ga: Ainm Seicheamhach
th: ชื่อลำดับ

source: Service URL
ga: URL seirbhíse
th: URL บริการ

source: Services
ga: Seirbhísí
th: URL บริการ

source: Session
ga: Seisiún
th: การประชุม

source: Session ID
ga: Aitheantas an tseisiúin
th: รหัสเซสชัน

source: Sessions
ga: Seisiúin
th: เซสชัน

source: Settings
ga: Socruithe
th: การตั้งค่า

source: Settings saved
ga: Socruithe sábháilte
th: การตั้งค่าที่บันทึกไว้

source: Setup
ga: Socrú
th: ติดตั้ง

source: Share
ga: Comhroinn
th: แบ่งปัน

source: Share %{s}
ga: Roinn %{s}
th: แบ่งปัน %{s}

source: Share your pictures with other apps and services.
ga: Roinn do chuid pictiúr le haipeanna agus seirbhísí eile.
th: แบ่งปันรูปภาพของคุณกับแอพและบริการอื่นๆ

source: Show
ga: Taispeáin
th: แสดง

source: Show all new faces
ga: Taispeáin gach aghaidh nua
th: แสดงใบหน้าใหม่ทั้งหมด

source: Show hidden
ga: Taispeáin i bhfolach
th: แสดงที่ซ่อนอยู่

source: Show less
ga: Taispeáin níos lú
th: แสดงน้อยลง

source: Show more
ga: Taispeáin níos mó
th: แสดงมากขึ้น

source: Show server logs in Library.
ga: Taispeáin logaí freastalaí sa Leabharlann.
th: แสดงบันทึกเซิร์ฟเวอร์ในไลบรารี

source: Show/Hide Sidebar
ga: Taispeáin/Folaigh Barra Taoibh
th: แสดง/ซ่อนแถบด้านข้าง

source: Sidecar
ga: Taobhcharr
th: ไซด์คาร์

source: Sidecar Files
ga: Comhaid Thaobhcharr
th: ไฟล์รถไซด์คาร์

source: Sign in
ga: Sínigh isteach
th: เข้าสู่ระบบ

source: Similar
ga: Cosúil
th: คล้ายกัน

source: Size
ga: Méid
th: ขนาด

source: Slow
ga: Mall
th: ช้า

source: Software
ga: Bogearraí
th: ซอฟต์แวร์

source: Software Update
ga: Nuashonrú Bogearraí
th: การอัปเดตซอฟต์แวร์

source: Something went wrong, try again
ga: Chuaigh rud éigin mícheart, bain triail eile as
th: เกิดข้อผิดพลาด โปรดลองอีกครั้ง

source: Sort by
ga: Sórtáil de réir
th: จัดเรียงตาม

source: Sort Order
ga: Ordú Sórtála
th: เรียงลำดับ

source: Sorted ascending.
ga: Sórtáilte ardaitheach.
th: เรียงลำดับจากน้อยไปมาก

source: Sorted descending.
ga: Sórtáilte íslitheach.
th: เรียงลำดับจากมากไปน้อย

source: Source
ga: Foinse
th: แหล่งที่มา

source: Stack
ga: Cruachán
th: ซ้อนกัน

source: Stack files sharing the same unique image or instance identifier.
ga: Stack comhaid a roinnt ar an íomhá uathúil céanna nó aitheantóir shampla.
th: สแต็คไฟล์ที่แชร์รูปภาพที่ไม่ซ้ำกันหรือตัวระบุอินสแตนซ์เดียวกัน

source: Stack pictures taken at the exact same time and location based on their metadata.
ga: Stack pictiúir a tógadh ag an am céanna agus an suíomh céanna bunaithe ar a meiteashonraí.
th: กองรูปภาพที่ถ่ายในเวลาและสถานที่เดียวกันโดยอิงตามข้อมูลเมตา

source: Stackable
ga: Cruachta
th: วางซ้อนกันได้

source: Stacks
ga: Cruacha
th: กอง

source: Start
ga: Tosaigh
th: เริ่ม

source: Start/Stop Slideshow
ga: Tosaigh/Stop Taispeántas Sleamhnán
th: เริ่ม/หยุดสไลด์โชว์

source: Static Size Limit: %{n}px
ga: Teorainn Mhéid Statach: %{n}px
th: ขีดจำกัดขนาดคงที่: %{n}px

source: Status
ga: Stádas
th: สถานะ

source: Storage
ga: Stóráil
th: พื้นที่จัดเก็บ

source: Streets
ga: Sráideanna
th: ถนน

source: Subject
ga: Ábhar
th: เรื่อง

source: Successfully activated
ga: Cuireadh i ngníomh go rathúil
th: เปิดใช้งานสำเร็จแล้ว

source: Successfully Connected
ga: D'éirigh leis Ceangailte
th: เชื่อมต่อเรียบร้อยแล้ว

source: Successfully deleted
ga: Scriosadh go rathúil
th: ลบเรียบร้อยแล้ว

source: Successfully verified
ga: D'éirigh leis a fhíorú
th: ตรวจสอบเรียบร้อยแล้ว

source: Super Admin
ga: Sár-Riarachán
th: ผู้ดูแลระบบขั้นสูง

source: Support for additional services, like Google Drive, will be added over time.
ga: Cuirfear tacaíocht le haghaidh seirbhísí breise, amhail Google Drive, leis in imeacht ama.
th: การสนับสนุนบริการเพิ่มเติม เช่น Google ไดรฟ์ จะถูกเพิ่มเข้ามาเรื่อยๆ

source: Support Our Mission
ga: Tacaigh lenár Misean
th: สนับสนุนภารกิจของเรา

source: Sync
ga: Sioncrónaigh
th: ซิงค์

source: Sync raw and video files
ga: Sioncronaigh comhaid amh agus físe
th: ซิงค์ไฟล์ดิบและวิดีโอ

source: Taken
ga: Tógtha
th: ถ่าย

source: Teal
th: นกเป็ดน้ำ

source: TensorFlow is required for image classification, facial recognition, and detecting unsafe content.
ga: Tá TensorFlow ag teastáil le haghaidh aicmiú íomhá, aithint aghaidhe, agus ábhar neamhshábháilte a bhrath.
th: ต้องใช้ TensorFlow สำหรับการจัดหมวดหมู่รูปภาพ การจดจำใบหน้า และการตรวจจับเนื้อหาที่ไม่ปลอดภัย

source: Text
ga: Téacs
th: ข้อความ

source: Text too long
ga: Téacs ró-fhada
th: ข้อความยาวเกินไป

source: Thank You for Your Support!
ga: Go raibh maith agat as do Thacaíocht!
th: ขอบคุณสำหรับการสนับสนุน!

source: That's why PhotoPrism was built from the ground up to run wherever you need it, without compromising freedom, privacy, or functionality.
ga: Sin an fáth a tógadh PhotoPrim ón talamh aníos le rith cibé áit a dteastaíonn uait é, gan cur isteach ar shaoirse, ar phríobháideachas ná ar fheidhmiúlacht.
th: นั่นเป็นเหตุผลที่ PhotoPrism ถูกสร้างขึ้นใหม่ทั้งหมดเพื่อให้ทำงานได้ทุกที่ที่คุณต้องการ โดยไม่กระทบต่อเสรีภาพ ความเป็นส่วนตัว หรือฟังก์ชันการทำงาน

source: The index currently contains %{n} hidden files.
ga: Tá %{n} comhad folaithe san innéacs faoi láthair.
th: ขณะนี้ดัชนีมีไฟล์ที่ซ่อนอยู่ %{n} ไฟล์

source: Their format may not be supported, they haven't been converted to JPEG yet or there are duplicates.
ga: Seans nach dtacaítear lena bhformáid, níor tiontaigh go JPEG iad go fóill nó go bhfuil dúbailt ann.
th: รูปแบบของไฟล์อาจไม่ได้รับการสนับสนุน ยังไม่ได้แปลงเป็น JPEG หรือมีรูปแบบที่ซ้ำกัน

source: Theme
ga: Téama
th: ธีม

source: This field is required
ga: Tá an réimse seo ag teastáil
th: ฟิลด์นี้จำเป็นต้องกรอก

source: This mounts the originals folder as a network drive and allows you to open, edit, and delete files from your computer or smartphone as if they were local.
ga: Gléasann sé seo an bunfhillteán mar thiomántán líonra agus ligeann sé duit comhaid a oscailt, a chur in eagar agus a scriosadh ó do ríomhaire nó ó do ghuthán cliste amhail is go raibh siad áitiúil.
th: การดำเนินการนี้จะต่อเชื่อมโฟลเดอร์ต้นฉบับเป็นไดรฟ์เครือข่าย และช่วยให้คุณสามารถเปิด แก้ไข และลบไฟล์จากคอมพิวเตอร์หรือสมาร์ทโฟนได้เสมือนอยู่ในเครื่อง

source: Time UTC
ga: Am UTC
th: เวลาUTC

source: Time Zone
ga: Crios Ama
th: เขตเวลา

source: Timeout
ga: Teorainn Ama
th: หมดเวลา

# Account
source: Title
ga: Teideal
th: ชื่อ

# Photo
source: Title
ga: Teideal
th: ชื่อ

source: Title
ga: Teideal
th: ชื่อ

source: Title / Position
ga: Teideal / Post
th: ชื่อเรื่องยาวเกินไป

source: Title too long
ga: Teideal ró-fhada
th: ชื่อเรื่องยาวเกินไป

source: to
ga: chuig
th: ถึง

source: To avoid being locked out of your account, please download, print or copy this recovery code now and keep it in a safe place.
ga: Chun a sheachaint a bheith glasáilte amach ó do chuntas, íoslódáil, priontáil nó cóipeáil an cód athshlánaithe seo anois agus coinnigh in áit shábháilte é.
th: เพื่อหลีกเลี่ยงการถูกล็อคออกจากบัญชีของคุณ โปรดดาวน์โหลด พิมพ์ หรือคัดลอกรหัสกู้คืนนี้ทันทีและเก็บไว้ในที่ปลอดภัย

source: To generate a new app-specific password, please enter the name and authorization scope of the application and select an expiration date:
ga: Chun pasfhocal nua a bhaineann go sonrach le haip a ghiniúint, cuir isteach ainm agus raon feidhme údaraithe an fheidhmchláir agus roghnaigh dáta éaga:
th: หากต้องการสร้างรหัสผ่านเฉพาะแอปใหม่ โปรดป้อนชื่อและขอบเขตการอนุญาตของแอปพลิเคชัน และเลือกวันหมดอายุ:

source: To switch to a new authenticator app or device, first deactivate two-factor authentication and then reactivate it:
ga: Chun athrú go haip nó gléas fíordheimhneora nua, díghníomhachtaigh fíordheimhniú dhá fhachtóir ar dtús agus ansin athghníomhaigh é:
th: หากต้องการสลับไปใช้แอพหรืออุปกรณ์ตรวจสอบความถูกต้องใหม่ ให้ปิดการใช้งานการตรวจสอบสิทธิ์แบบสองปัจจัยก่อนแล้วจึงเปิดใช้งานอีกครั้ง:

source: To upgrade, you can either enter an activation code or click "Register" to sign up on our website:
ga: Chun uasghrádú a dhéanamh, is féidir leat cód gníomhachtúcháin a chur isteach nó cliceáil "Cláraigh" chun clárú ar ár suíomh Gréasáin:
th: หากต้องการอัปเกรด คุณสามารถป้อนรหัสเปิดใช้งานหรือคลิก "ลงทะเบียน" เพื่อลงทะเบียนบนเว็บไซต์ของเรา:

source: Today
ga: Inniu
th: วันนี้

source: Toggle View
ga: Scoránaigh Amharc
th: สลับมุมมอง

source: Token
ga: Comhartha
th: โทเค็น

source: Too many files selected
ga: An iomarca comhad roghnaithe
th: เลือกไฟล์มากเกินไป

source: Too many requests
ga: An iomarca iarratas
th: คำขอมากเกินไป

source: Topographic
ga: Topagrafach
th: ภูมิประเทศ

source: Troubleshooting
ga: Fabhtcheartú
th: การแก้ไขปัญหา

source: Try again using other filters or keywords.
ga: Bain triail eile as scagairí nó eochairfhocail eile.
th: ลองอีกครั้งโดยใช้ตัวกรองหรือคำหลักอื่น

source: Two-factor authentication has been enabled for your account.
ga: Cumasaíodh fíordheimhniú dhá fhachtóir do do chuntas.
th: เปิดใช้งานการรับรองความถูกต้องด้วยสองปัจจัยสำหรับบัญชีของคุณแล้ว

source: Type
ga: Cineál
th: พิมพ์

source: Unauthorized
ga: Neamhúdaraithe
th: ไม่ได้รับอนุญาต

source: Undo
ga: Cealaigh
th: เลิกทำ

source: Unique ID
ga: Aitheantas uathúil
th: ID ไม่ซ้ำกัน

source: Unknown
ga: Anaithnid
th: ไม่รู้จัก

source: Unregistered
ga: Neamhchláraithe
th: ไม่ได้ลงทะเบียน

source: Unsorted
ga: Neamhshórtáilte
th: ไม่เรียงลำดับ

source: Unstack
ga: Díscrios
th: แกะ

source: Updated
ga: Nuashonraithe
th: อัปเดต

source: Updating faces
ga: Aghaidheanna á nuashonrú
th: กำลังอัปเดตใบหน้า

source: Updating index
ga: Innéacs á nuashonrú
th: กำลังอัปเดตดัชนี

source: Updating moments
ga: Nóiméid á nuashonrú
th: กำลังอัปเดตช่วงเวลา

source: Updating picture…
ga: Pictiúr á nuashonrú…
th: กำลังอัปเดตตัวอย่าง

source: Updating previews
ga: Réamhamhairc á nuashonrú
th: กำลังอัปเดตตัวอย่าง

source: Updating stacks
ga: Stoic á nuashonrú
th: กำลังอัปเดตกอง

source: Upgrade
ga: Uasghrádú
th: อัปเกรด

source: Upgrade Now
ga: Uasghrádaigh Anois
th: อัพเกรดเดี๋ยวนี้

source: Upload
ga: Uaslódáil
th: ที่อัพโหลด

source: Upload complete
ga: Uaslódáil iomlán
th: อัพโหลดเสร็จแล้ว

source: Upload complete. Indexing…
ga: Uaslódáil iomlán. Innéacsú…
th: อัพโหลดเสร็จแล้ว กำลังจัดทำดัชนี…

source: Upload failed
ga: Theip ar an uaslódáil
th: การอัพโหลดล้มเหลว

source: Upload local files
ga: Íoslódáil comhaid áitiúla
th: อัปโหลดไฟล์ในเครื่อง

source: Upload Path
ga: Bealach Uaslódáil
th: อัปโหลดเส้นทาง

source: Upload to WebDAV and share links with friends.
ga: Uaslódáil chuig WebDAV agus roinn naisc le cairde.
th: อัปโหลดไปยัง WebDAV และแชร์ลิงก์กับเพื่อน

source: Uploading %{n} of %{t}…
ga: %{n} de %{t} á uaslódáil…
th: กำลังอัปโหลด %{n} จาก %{t}…

source: Uploading photos…
ga: Grianghraif á n-uaslódáil…
th: กำลังอัปโหลดรูปภาพ…

source: Uploading…
ga: Á uaslódáil…
th: กำลังโหลดซ้ำ…

source: Uploads that may contain such images will be rejected automatically.
ga: Diúltófar go huathoibríoch d’uaslódálacha a bhféadfadh íomhánna den sórt sin a bheith iontu.
th: การอัปโหลดที่อาจมีภาพดังกล่าวจะถูกปฏิเสธโดยอัตโนมัติ

source: Use Presets
ga: Úsáid Réamhshocruithe
th: ใช้พรีเซ็ต

source: Use the following recovery code to access your account when you are unable to generate a valid verification code with your authenticator app:
ga: Úsáid an cód athshlánaithe seo a leanas chun rochtain a fháil ar do chuntas nuair nach bhfuil tú in ann cód fíoraithe bailí a ghiniúint le d’aip fíordheimhneora:
th: ใช้รหัสกู้คืนต่อไปนี้เพื่อเข้าถึงบัญชีของคุณเมื่อคุณไม่สามารถสร้างรหัสยืนยันที่ถูกต้องด้วยแอปตรวจสอบสิทธิ์ของคุณได้:

source: Use your recovery code or contact an administrator for help.
ga: Bain úsáid as do chód athshlánaithe nó déan teagmháil le riarthóir chun cabhair a fháil.
th: ใช้รหัสกู้คืนของคุณหรือติดต่อผู้ดูแลระบบเพื่อขอความช่วยเหลือ

source: User
ga: Úsáideoir
th: ผู้ใช้

source: User Guide
ga: Treoir Úsáideora
th: คู่มือผู้ใช้

source: User Interface
ga: Comhéadan Úsáideora
th: หน้าจอผู้ใช้

source: Username
ga: Ainm úsáideora
th: ชื่อผู้ใช้

source: Users
ga: Úsáideoirí
th: ผู้ใช้

source: Vector
ga: Veicteoir
th: เวกเตอร์

source: Vectors
ga: Veicteoirí
th: เวกเตอร์

source: Verification Code
ga: Cód Fíoraithe
th: รหัสยืนยัน

source: Video
ga: Físeán
th: วีดีโอ

source: Video Duration
ga: Fad Físeáin
th: ระยะเวลา

source: Videos
ga: Físeáin
th: วิดีโอ

source: View
ga: Amharc
th: ดู

source: Viewer
ga: Amharcóir
th: ผู้ดู

source: Visitor
ga: Cuairteoir
th: ผู้เข้าชม

source: Visual Similarity
ga: Cosúlacht Amharc
th: จัดกลุ่มตามความเหมือน

source: Warning
ga: Rabhadh
th: คำเตือน

source: We appreciate your feedback!
ga: Táimid buíoch as do chuid aiseolais!
th: ขอขอบคุณสำหรับความคิดเห็นของคุณ!

source: We do our best to respond within five business days or less.
ga: Déanaimid ár ndícheall freagra a thabhairt laistigh de chúig lá gnó nó níos lú.
th: เราพยายามอย่างเต็มที่ที่จะตอบกลับภายในห้าวันทำการหรือน้อยกว่านั้น

source: Web Login
ga: Logáil Isteach Gréasáin
th: เข้าสู่ระบบเว็บ

source: WebDAV
th: เว็บDAV

source: WebDAV clients can connect to PhotoPrism using the following URL:
ga: Is féidir le cliaint WebDAV ceangal le PhotoPrim leis an URL seo a leanas:
th: ไคลเอ็นต์ WebDAV สามารถเชื่อมต่อกับ PhotoPrism โดยใช้ URL ต่อไปนี้:

source: WebDAV clients, like Microsoft’s Windows Explorer or Apple's Finder, can connect directly to PhotoPrism.
ga: Is féidir le cliaint WebDAV, cosúil le Windows Explorer nó Aimsitheoir Apple de chuid Microsoft, nascadh go díreach le PhotoPrism.
th: ไคลเอนต์ WebDAV เช่น Windows Explorer ของ Microsoft หรือ Finder ของ Apple สามารถเชื่อมต่อโดยตรงกับ PhotoPrism

source: WebDAV Upload
ga: Uaslódáil WebDAV
th: อัพโหลด WebDAV

source: WebGL support is disabled in your browser
ga: Tá tacaíocht WebGL díchumasaithe i do bhrabhsálaí
th: การรองรับ WebGL ถูกปิดใช้งานในเบราว์เซอร์ของคุณ

source: Website
ga: Suíomh Gréasáin
th: เว็บไซต์

source: White
ga: Bán
th: สีขาว

source: Work Details
ga: Sonraí Oibre
th: รายละเอียด

source: Year
ga: Bliain
th: ปี

source: Yellow
ga: Buí
th: สีเหลือง

source: Yes
ga: Tá
th: ใช่

source: You are welcome to contact us at membership@photoprism.app for questions regarding your membership.
ga: Tá fáilte romhat teagmháil a dhéanamh linn ag membership@photoprism.app le haghaidh ceisteanna maidir le do bhallraíocht.
th: คุณสามารถติดต่อเราได้ที่ membership@photoprism.app สำหรับคำถามเกี่ยวกับการเป็นสมาชิกของคุณ

source: You can only download one album
ga: Is féidir leat a íoslódáil albam amháin
th: ดาวน์โหลดได้เพียงอัลบั้มเดียว

source: You can only download one label
ga: Ní féidir leat ach lipéad amháin a íoslódáil
th: คุณสามารถดาวน์โหลดป้ายกำกับได้เพียงป้ายเดียว

source: You can upload up to %{n} files for test purposes.
ga: Is féidir leat suas le %{n} comhad a uaslódáil chun críocha tástála.
th: คุณสามารถอัปโหลดไฟล์ได้มากถึง %{n} ไฟล์เพื่อการทดสอบ

source: You may only select one item
ga: Ní féidir leat ach mír amháin a roghnú
th: เลือกได้เพียงรายการเดียวเท่านั้น

source: You may rescan your library to find additional faces.
ga: Is féidir leat do leabharlann a athscanadh chun aghaidheanna breise a fháil.
th: คุณสามารถสแกนคลังของคุณเพื่อค้นหาใบหน้าเพิ่มเติม

source: Your account has been successfully connected.
ga: D'éirigh le do chuntas a nascadh.
th: บัญชีของคุณเชื่อมต่อสำเร็จแล้ว

source: Your browser does not support WebGL
ga: Ní thacaíonn do bhrabhsálaí le WebGL
th: เบราว์เซอร์ของคุณไม่รองรับ WebGL

source: Your continued support helps us provide regular updates and remain independent, so we can fulfill our mission and protect your privacy.
ga: Cuidíonn do thacaíocht leanúnach linn nuashonruithe rialta a sholáthar agus fanacht neamhspleách, ionas gur féidir linn ár misean a chomhlíonadh agus do phríobháideachas a chosaint.
th: การสนับสนุนอย่างต่อเนื่องของคุณช่วยให้เราอัปเดตและบริการต่างๆ เป็นประจำ เช่น แผนที่โลก

source: Your library is continuously analyzed to automatically create albums of special moments, trips, and places.
ga: Déantar anailís leanúnach ar do leabharlann chun albam chuimhneacháin, thurais agus áiteanna speisialta a chruthú go huathoibríoch.
th: คลังของคุณได้รับการวิเคราะห์อย่างต่อเนื่องเพื่อสร้างอัลบั้มของช่วงเวลา การเดินทาง และสถานที่พิเศษโดยอัตโนมัติ

source: Zoom in/out
ga: Súmáil isteach/amach
th: ซูมเข้า/ออก

source: Blackman: Lanczos Modification, Less Ringing Artifacts
ga: Fear Dubh: Modhnú Lanczos, Níos Lú Déantán Glaonna

source: F Number
ga: F Uimhir

source: FPS
ga: CCT
