Repository: lwd-temp/photoprism
Catalog: frontend/src/locales/*.po
Languages: ga, th

source: {0} appended action
ga: {0} gníomh curtha leis
th: {0} การดำเนินการผนวก

source: {0} files
ga: {0} gcomhad
th: {0} ไฟล์

source: {0} files ({1} in total)
ga: {0} comhad ({1} san iomlán)
th: {0} ไฟล์ (รวมทั้งหมด {1} ไฟล์)

source: {0} more
ga: {0} eile
th: {0} เพิ่มเติม

source: {0} prepended action
ga: {0} gníomh réamhullmhaithe
th: {0} การดำเนินการที่เพิ่มมา

source: {0} selected
ga: {0} roghnaithe
th: {0} เลือกแล้ว

source: {0}-{1} of {2}
ga: {0}-{1} de {2}
th: {0}-{1} จาก {2}

source: %{n} albums found
ga: Aimsíodh %{n} albam
th: พบ %{n} อัลบั้ม

source: %{n} files uploaded
ga: %{n} comhad uaslódála
th: อัปโหลดแล้ว %{n} ไฟล์

source: %{n} folders found
ga: Aimsíodh %{n} fillteán
th: พบ %{n} โฟลเดอร์

source: %{n} GB of %{q} GB used
ga: Úsáideadh %{n} GB as %{q} GB
th: %{n} GB จาก %{q} GB ที่ใช้

source: %{n} labels found
ga: Aimsíodh %{n} lipéad
th: พบ %{n} ป้ายกำกับ

source: %{n} people found
ga: Aimsíodh %{n} duine
th: พบบุคคล %{n} คน

source: %{n} pictures found
ga: Aimsíodh %{n} pictiúr
th: พบ %{n} รูปภาพ

source: %{s} is too long
ga: Tá %{s} rófhada
th: %{s} ยาวเกินไป

source: %{s} is too short
ga: Tá %{s} ró-ghearr
th: %{s} สั้นเกินไป

source: 1 hour
ga: 1 uair
th: 1 ชั่วโมง

source: 12 hours
ga: 12 uair an chloig
th: 12 ชั่วโมง

source: 2-Factor Authentication
ga: Fíordheimhniú 2-Fachtóir
th: การรับรองความถูกต้องแบบ 2 ปัจจัย

source: 4 hours
ga: 4 uair an chloig
th: 4 ชั่วโมง

source: A click will copy it to your clipboard.
ga: Déanfaidh cliceáil é a chóipeáil chuig do ghearrthaisce.
th: คลิกเพื่อคัดลอกไปยังคลิปบอร์ด

source: A new version of %{s} is available:
ga: Tá leagan nua de %{s} ar fáil:
th: %{s} เวอร์ชันใหม่พร้อมให้ใช้งานแล้ว:

source: About
ga: Maidir
th: เกี่ยวกับ

source: Access Token
ga: Comhartha Rochtana
th: โทเค็นการเข้าถึง

source: Account
ga: Cuntas
th: บัญชี

source: Account created
ga: Cuntas cruthaithe
th: สร้างบัญชีแล้ว

source: Account deleted
ga: Scriosadh an cuntas
th: ลบบัญชีแล้ว

source: Accounts
ga: Cuntais
th: บัญชี

source: Accuracy
ga: Cruinneas
th: ความแม่นยำ

source: Action
ga: Gníomh
th: การกระทำ

source: Actions
ga: Gníomhartha
th: การกระทำ

source: Activate
ga: Gníomhachtaigh
th: เปิดใช้งาน

source: Activate to remove sorting.
ga: Gníomhachtaigh chun sórtáil a bhaint.
th: เปิดใช้งานเพื่อลบการเรียงลำดับ

source: Activate to sort ascending.
ga: Gníomhachtaigh chun dul suas a shórtáil.
th: เปิดใช้งานเพื่อเรียงลำดับจากน้อยไปมาก

source: Activate to sort descending.
ga: Gníomhachtaigh chun íslitheach a shórtáil.
th: เปิดใช้งานการเรียงลำดับจากมากไปน้อย

source: Activation Code
ga: Cód gníomhachtúcháin
th: รหัสเปิดใช้งาน

source: Add
ga: Cuir
th: เพิ่ม

source: Add %{s}?
ga: Cuir %{s} leis?
th: เพิ่ม %{s}?

source: Add Account
ga: Cuir Cuntas leis
th: แก้ไขบัญชี

source: Add Album
ga: Cuir Albam leis
th: เพิ่มอัลบั้ม

source: Add files to your library via Web Upload.
ga: Cuir comhaid le do leabharlann trí Uaslódáil Gréasáin.
th: เพิ่มไฟล์ไปยังคลังผ่านการอัปโหลดเว็บ

source: Add Link
ga: Cuir Nasc leis
th: เพิ่มลิงก์

source: Add person?
ga: Cuir duine leis?
th: เพิ่มบุคคล?

source: Add pictures from search results by selecting them.
ga: Cuir pictiúir ó thorthaí cuardaigh leis trína roghnú.
th: เพิ่มรูปภาพจากผลการค้นหาโดยเลือกรูปภาพเหล่านั้น

source: Add to album
ga: Cuir leis an albam
th: เพิ่มไปยังอัลบั้ม

source: Added
ga: Curtha leis
th: เพิ่มแล้ว

source: Admin
ga: Riarachán
th: ผู้ดูแลระบบ

source: Advanced
ga: Casta
th: ขั้นสูง

source: After 1 day
ga: Tar éis 1 lá
th: หลังจาก 1 วัน

source: After 3 days
ga: Tar éis 3 lá
th: หลังจาก 3 วัน

source: After 7 days
ga: Tar éis 7 lá
th: หลังจาก 7 วัน

source: After entering your password for confirmation, you can set up two-factor authentication with a compatible authenticator app or device:
ga: Tar éis duit do phasfhocal a chur isteach lena dheimhniú, is féidir leat fíordheimhniú dhá fhachtóir a shocrú le haip nó gléas fíordheimhneora comhoiriúnach:
th: หลังจากป้อนรหัสผ่านเพื่อยืนยัน คุณสามารถตั้งค่าการตรวจสอบสิทธิ์แบบสองปัจจัยด้วยแอพหรืออุปกรณ์ตรวจสอบสิทธิ์ที่เข้ากันได้:

source: After one month
ga: Tar éis míosa
th: หลังจากหนึ่งเดือน

source: After one year
ga: Tar éis bliana amháin
th: หลังจากหนึ่งปี

source: After selecting pictures from search results, you can add them to an album using the context menu.
ga: Tar éis duit pictiúir a roghnú ó thorthaí cuardaigh, is féidir leat iad a chur le halbam ag baint úsáide as an roghchlár comhthéacs.
th: หลังจากเลือกรูปภาพจากผลการค้นหาแล้ว คุณสามารถเพิ่มรูปภาพลงในอัลบั้มโดยใช้เมนูบริบท

source: After two months
ga: Tar éis dhá mhí
th: หลังจากสองเดือน

source: After two weeks
ga: Tar éis dhá sheachtain
th: หลังจากสองสัปดาห์

source: Album
ga: Albam
th: อัลบั้ม

source: Album Backups
ga: Cúltaca Albam
th: การสำรองข้อมูลอัลบั้ม

source: Album created
ga: Albam cruthaithe
th: สร้างอัลบั้มแล้ว

source: Albums
ga: Albaim
th: อัลบั้ม

source: Albums deleted
ga: Albaim scriosta
th: ลบอัลบั้มแล้ว

source: All
ga: Gach
th: ทั้งหมด

source: All %{n} albums loaded
ga: Gach %{n} albam luchtaithe
th: โหลด %{n} อัลบั้มทั้งหมดแล้ว

source: All %{n} labels loaded
ga: Gach %{n} lipéad luchtaithe
th: โหลดป้ายกำกับ %{n} ทั้งหมดแล้ว

source: All %{n} people loaded
ga: Gach %{n} duine luchtaithe
th: โหลด %{n} คนทั้งหมดแล้ว

source: All Cameras
ga: Gach ceamaraí
th: กล้องทั้งหมด

source: All Categories
ga: Gach Catagóir
th: หมวดหมู่ทั้งหมด

source: All Colors
ga: Gach Dathanna
th: สีทั้งหมด

source: All Countries
ga: Gach Tíortha
th: ประเทศทั้งหมด

source: All fields are required
ga: Tá gach réimse ag teastáil
th: ต้องกรอกให้ครบทุกช่อง

source: All files from import folder
ga: Gach comhad ón bhfillteán allmhairiú
th: ทุกไฟล์จากโฟลเดอร์นำเข้า

source: All Lenses
ga: Gach Lionsaí
th: เลนส์ทั้งหมด

source: All Months
ga: Gach Míonna
th: เดือนทั้งหมด

source: All originals
ga: Gach bunleagan
th: ต้นฉบับทั้งหมด

source: All Years
ga: Gach Bliain
th: ปีทั้งหมด

source: Alternatively, you can upload files directly to WebDAV servers like Nextcloud.
ga: Nó, is féidir leat comhaid a uaslódáil go díreach chuig freastalaithe WebDAV cosúil le Nextcloud.
th: หรือคุณสามารถอัปโหลดไฟล์โดยตรงไปยังเซิร์ฟเวอร์ WebDAV เช่น Nextcloud

source: Altitude
ga: Airde
th: ระดับความสูง

source: Altitude (m)
ga: airde (m)
th: ระดับความสูง (ม.)

source: AM
th: เช้า

source: Animated
ga: Beoite
th: เคลื่อนไหว

source: Animation
ga: Beochan
th: แอนิเมชัน

source: Any private photos and videos remain private and won't be shared.
ga: Fanann aon ghrianghraif agus físeáin phríobháideacha príobháideach agus ní roinnfear iad.
th: รูปภาพและวิดีโอส่วนตัวทั้งหมดจะยังคงเป็นส่วนตัว และจะไม่แชร์กับผู้อื่น

source: API Key
ga: Eochair API
th: กุญแจ API

source: Application
ga: Iarratas
th: แอปพลิเคชัน

source: Apply
ga: Cuir iarratas isteach
th: ปรับใช้

source: Approve
ga: Cheadaigh
th: อนุมัติ

source: Apps and Devices
ga: Aipeanna agus Gléasanna
th: แอพและอุปกรณ์

source: Archive
ga: Cartlann
th: คลังเก็บเอกสารสำคัญ

source: Archived
ga: Cartlannaithe
th: ที่เก็บถาวร

source: Are you sure you want to archive the selection?
ga: An bhfuil tú cinnte gur mhaith leat an rogha a chur sa chartlann?
th: คุณแน่ใจหรือไม่ว่าต้องการเก็บถาวรส่วนที่เลือก

source: Are you sure you want to delete these albums?
ga: An bhfuil tú cinnte gur mhaith leat na halbaim seo a scriosadh?
th: คุณแน่ใจหรือไม่ว่าต้องการลบอัลบั้มเหล่านี้

source: Are you sure you want to delete these labels?
ga: An bhfuil tú cinnte gur mhaith leat na lipéid seo a scriosadh?
th: คุณแน่ใจหรือไม่ว่าต้องการลบป้ายกำกับเหล่านี้

source: Are you sure you want to delete this account?
ga: An bhfuil tú cinnte gur mhaith leat an cuntas seo a scriosadh?
th: คุณแน่ใจหรือไม่ว่าต้องการลบบัญชีนี้

source: Are you sure you want to permanently delete these pictures?
ga: An bhfuil tú cinnte gur mhaith leat na pictiúir seo a scriosadh go buan?
th: คุณแน่ใจหรือไม่ว่าต้องการลบรูปภาพเหล่านี้อย่างถาวร

source: Are you sure you want to permanently delete this file?
ga: An bhfuil tú cinnte gur mian leat an comhad seo a scriosadh go buan?
th: คุณแน่ใจหรือไม่ว่าต้องการลบไฟล์นี้อย่างถาวร

source: Are you sure?
ga: An bhfuil tú cinnte?
th: คุณแน่ใจหรือไม่?

source: Artist
ga: Ealaíontóir
th: ศิลปิน

source: Aspect Ratio
ga: Cóimheas Gné
th: อัตราส่วน

source: Authentication
ga: Fíordheimhniú
th: การรับรองความถูกต้อง

source: Auto
th: ออโต้

source: Back
ga: Ar ais
th: กลับ

source: Back to top
ga: Ar ais go barr
th: กลับสู่ด้านบน

source: Backup
ga: Cúltaca
th: สำรองข้อมูล

source: Badge
ga: Suaitheantas
th: ป้าย

source: Base Path
ga: Conair Bhun
th: เส้นทางฐาน

source: Become a member today, support our mission and enjoy our member benefits!
ga: Bí i do bhall inniu, tacaigh lenár misean agus bain taitneamh as ár mbuntáistí ball!
th: เป็นสมาชิกวันนี้ สนับสนุนพันธกิจของเรา และเพลิดเพลินไปกับสิทธิประโยชน์สำหรับสมาชิกของเรา!

source: Being 100% self-funded and independent, we can promise you that we will never sell your data and that we will always be transparent about our software and services.
ga: Agus sinn 100% féinmhaoinithe agus neamhspleách, is féidir linn geallúint a thabhairt duit nach ndíolfaimid do shonraí choíche agus go mbeimid trédhearcach i gcónaí maidir lenár mbogearraí agus ár seirbhísí.
th: ด้วยการจัดหาเงินทุนด้วยตนเองและเป็นอิสระ 100% เราสามารถสัญญากับคุณได้ว่าเราจะไม่ขายข้อมูลของคุณและเราจะมีความโปร่งใสเกี่ยวกับซอฟต์แวร์และบริการของเราเสมอ

source: Bio
ga: Bith
th: ไปโอ

source: Birth Date
ga: Dáta Breithe
th: วันที่เกิด

source: Black
ga: Dubh
th: สีดำ

source: Blue
ga: Gorm
th: สีฟ้า

source: Brown
ga: Donn
th: สีน้ำตาล

source: Browse
ga: Brabhsáil
th: เรียกดู

source: Browse and edit image classification labels.
ga: Brabhsáil agus cuir in eagar lipéid rangaithe íomhánna.
th: เรียกดูและแก้ไขป้ายกำกับการจัดประเภทรูปภาพ

source: Browse Files
ga: Brabhsáil Comhaid
th: เรียกดูไฟล์

source: Browse indexed files and folders in Library.
ga: Brabhsáil comhaid agus fillteáin innéacsaithe sa Leabharlann.
th: เรียกดูไฟล์และโฟลเดอร์ที่จัดทำดัชนีในไลบรารี

source: Bug Report
ga: Tuairisc ar Fhabht
th: รายงานข้อผิดพลาด

source: Busy, please wait…
ga: Gnóthach, fan go fóill…
th: ไม่ว่าง โปรดรอ…

source: By using the software and services we provide, you agree to our terms of service, privacy policy, and code of conduct.
ga: Trí úsáid a bhaint as na bogearraí agus na seirbhísí a chuirimid ar fáil, aontaíonn tú lenár dtéarmaí seirbhíse, ár mbeartas príobháideachta, agus ár gcód iompair.
th: โดยการใช้ซอฟต์แวร์และบริการที่เรามอบให้ แสดงว่าคุณยอมรับข้อกำหนดในการให้บริการ นโยบายความเป็นส่วนตัว และจรรยาบรรณของเรา

source: Calendar
ga: Féilire
th: ปฏิทิน

source: Camera
ga: Ceamara
th: กล้อง

source: Camera Serial
ga: Sraith ceamara
th: อนุกรมกล้อง

source: Can't access your authenticator app or device?
ga: Ní féidir rochtain a fháil ar d'aip nó gléas fíordheimhnitheora?
th: ไม่สามารถเข้าถึงแอปหรืออุปกรณ์ยืนยันตัวตนของคุณได้ใช่ไหม

source: Can't load more, limit reached
ga: Ní féidir níos mó a lódáil, shroich an teorainn
th: โหลดเพิ่มไม่ได้แล้ว หมดเขตแล้ว

source: Can't select more items
ga: Ní féidir níos mó míreanna a roghnú
th: ไม่สามารถเลือกรายการเพิ่มเติมได้

source: Cancel
ga: Cealaigh
th: ยกเลิก

source: Caption
ga: Fotheideal
th: คำบรรยาย

source: Cards
ga: Cártaí
th: การ์ด

source: Carousel slide {0} of {1}
ga: Sleamhnán timpealláin {0} de {1}
th: สไลด์หมุน {0} จาก {1}

source: Category
ga: Catagóir
th: หมวดหมู่

source: Change Avatar
ga: Athrú avatar
th: เปลี่ยนแฟล็กส่วนตัว

source: Change Password
ga: Athraigh Pasfhocal
th: รหัสผ่านใหม่

source: Change personal profile and security settings.
ga: Athraigh próifíl phearsanta agus socruithe slándála.
th: เปลี่ยนโปรไฟล์ส่วนบุคคลและการตั้งค่าความปลอดภัย

source: Change photo titles, locations, and other metadata.
ga: Athraigh teidil grianghraf, láithreacha agus meiteashonraí eile.
th: เปลี่ยนชื่อรูปภาพ สถานที่ และข้อมูลเมตาอื่นๆ

source: Change private flag
ga: Athraigh bratach phríobháideach
th: เปลี่ยนแฟล็กส่วนตัว

source: Changes could not be saved
ga: Níorbh fhéidir na hathruithe a shábháil
th: ไม่สามารถบันทึกการเปลี่ยนแปลง

source: Changes successfully saved
ga: Sábháladh na hathruithe
th: บันทึกการเปลี่ยนแปลงเรียบร้อยแล้ว

source: Changes to the advanced settings require a restart to take effect.
ga: Teastaíonn atosú chun athruithe a dhéanamh ar na hardsocruithe chun dul i bhfeidhm.
th: การเปลี่ยนแปลงการตั้งค่าขั้นสูงจำเป็นต้องรีสตาร์ทจึงจะมีผล

source: Checked
ga: Seiceáilte
th: ตรวจสอบแล้ว

source: Chroma
th: โครมา

source: Cleaning index and cache
ga: Innéacs agus taisce a ghlanadh
th: การทำความสะอาดดัชนีและแคช

source: Cleanup
ga: Glanta
th: ทำความสะอาด

source: Clear {0}
ga: Glan {0}
th: เคลียร์ {0}

source: Client
ga: Cliant
th: ลูกค้า

source: Client Credentials
ga: Dintiúir Cliant
th: ข้อมูลรับรองลูกค้า

source: Close
ga: Dún
th: ปิด

source: Codec
th: ตัวแปลงสัญญาณ

source: Color
ga: Dath
th: สี

source: Color Profile
ga: Próifíl Datha
th: สีโปรไฟล์

source: Colors
ga: Dathanna
th: สี

source: Compare Editions
ga: Déan comparáid idir Eagráin
th: เปรียบเทียบรุ่น

source: Complete Rescan
ga: Críochnaigh Athscanadh
th: สแกนใหม่ให้เสร็จ

source: Confidence
ga: Muinín
th: ค่าความมั่นใจ

source: Confirm
ga: Deimhnigh
th: ยืนยัน

source: Connect
ga: Ceangail
th: เชื่อมต่อ

source: Connect via WebDAV
ga: Ceangail trí WebDAV
th: เชื่อมต่อผ่าน WebDAV

source: Connected
ga: Ceangailte
th: เชื่อมต่อ

source: Contact Details
ga: Sonraí Teagmhála
th: ติดต่อเรา

source: Contact Us
ga: Déan Teagmháil Linn
th: ติดต่อเรา

source: Contains %{n} pictures.
ga: Tá %{n} pictiúr ann.
th: มี %{n} รูป

source: Contains one picture.
ga: Tá pictiúr amháin ann.
th: ประกอบด้วยหนึ่งภาพ

source: Content
th: เนื้อหา

source: Continue
ga: Lean ort
th: ดำเนินการต่อ

source: Continue with %{provider}
ga: Lean ar aghaidh le %{provider}
th: ดำเนินการต่อด้วย %{provider}

source: Contributor
ga: ranníocóir
th: ผู้ให้ข้อมูล

source: Converting
ga: Tiontú
th: กำลังแปลง

source: Copied to clipboard
ga: Cóipeáladh chuig an ngearrthaisce
th: คัดลอกไปยังคลิปบอร์ดแล้ว

source: Copy
ga: Cóip
th: สำเนา

source: Copyright
ga: Cóipcheart
th: ลิขสิทธิ์

source: Couldn't find anything.
ga: Níorbh fhéidir aon rud a aimsiú.
th: ไม่พบอะไรเลย

source: Country
ga: Tír
th: ประเทศ

source: Create Account
ga: Cruthaigh Cuntas
th: สร้างบัญชี

source: Create album
ga: Cruthaigh albam
th: สร้างอัลบั้ม

source: Create regular backups based on the configured schedule.
ga: Cruthaigh cúltacaí rialta bunaithe ar an sceideal cumraithe.
th: สร้างการสำรองข้อมูลดัชนีตามกำหนดเวลาที่กำหนดไว้

source: Create YAML files to back up album metadata.
ga: Cruthaigh comhaid YAML chun meiteashonraí albam a chúltaca.
th: สร้างไฟล์ YAML เพื่อสำรองข้อมูลเมตาของอัลบั้ม

source: Create YAML sidecar files to back up picture metadata.
ga: Cruthaigh comhaid taobhcharr YAML chun meiteashonraí pictiúir a chúltaca.
th: สร้างไฟล์ช่วยเหลือ YAML เพื่อสำรองข้อมูลเมตาของรูปภาพ

source: Created
ga: Cruthaithe
th: สร้างเมื่อ

source: Creating thumbnails for
ga: Mionsamhlacha a chruthú le haghaidh
th: การสร้างภาพขนาดย่อสำหรับ

source: Cubic: Moderate Quality, Good Performance
ga: Ciúbach: Cáilíocht Measartha, Dea-Fheidhmíocht
th: ลูกบาศก์: คุณภาพปานกลาง ประสิทธิภาพที่ดี

source: Current Password
ga: Pasfhocal Reatha
th: รหัสผ่านปัจจุบัน

source: Custom
ga: Saincheaptha
th: กำหนดเอง

source: Customer Support
ga: Tacaíocht do Chustaiméirí
th: สนับสนุนลูกค้า

source: Cyan
ga: Cian
th: สีฟ้า

source: Daily
ga: laethúil
th: รายวัน

source: Database Backups
ga: Cúltaca Bunachar Sonraí
th: การสำรองฐานข้อมูล

source: Day
ga: Lá
th: วัน

source: Deactivate
ga: Díghníomhachtaigh
th: ปิดการใช้งาน

source: Debug Logs
ga: Logchomhaid Dífhabhtaithe
th: บันทึกการดีบัก

source: Default
ga: Réamhshocrú
th: ค่าเริ่มต้น

source: Default Folder
ga: Fillteán Réamhshocraithe
th: โฟลเดอร์เริ่มต้น

source: Delete
ga: Scrios
th: ลบ

source: Delete All
ga: Scrios Uile
th: ลบทั้งหมด

source: Delete all?
ga: Scrios gach rud?
th: ลบทั้งหมด?

source: Delete orphaned index entries, sidecar files and thumbnails.
ga: Scrios iontrálacha innéacs dílleachta, comhaid taobhcharr agus mionsamhlacha.
th: ลบรายการดัชนีที่ถูกละเลย ไฟล์รถเทียมข้างรถจักรยานยนต์ และภาพขนาดย่อ

source: Description
ga: Cur síos
th: คำอธิบาย

source: Detailed instructions can be found in our User Guide.
ga: Is féidir treoracha mionsonraithe a fháil inár dTreoir Úsáideora.
th: คำแนะนำโดยละเอียดสามารถพบได้ในคู่มือผู้ใช้ของเรา

source: Details
ga: Sonraí
th: รายละเอียด

source: Dimensions
ga: Toisí
th: ขนาด

source: Disable Backups
ga: Díchumasaigh Cúltaca
th: ปิดการสำรองข้อมูล

source: Disable Darktable
ga: Díchumasaigh Darktable
th: ปิดการใช้งาน Darktable

source: Disable ExifTool
ga: Díchumasaigh ExifTool
th: ปิดการใช้งาน ExifTool

source: Disable features that require write permission for the originals folder.
ga: Díchumasaigh gnéithe a dteastaíonn cead scríofa uathu don fhillteán bunleagan.
th: ปิดใช้งานคุณลักษณะที่ต้องมีสิทธิ์ในการเขียนสำหรับโฟลเดอร์ต้นฉบับ

source: Disable FFmpeg
ga: Díchumasaigh FFmpeg
th: ปิดการใช้งาน FFmpeg

source: Disable ImageMagick
ga: Díchumasaigh ImageMagick
th: ปิดการใช้งาน ImageMagick

source: Disable interactive world maps and reverse geocoding.
ga: Díchumasaigh léarscáileanna idirghníomhacha an domhain agus geochódú droim ar ais.
th: ปิดการใช้งานแผนที่โลกเชิงโต้ตอบและการเข้ารหัสทางภูมิศาสตร์แบบย้อนกลับ

source: Disable Places
ga: Díchumasaigh Áiteanna
th: ปิดการใช้งานสถานที่

source: Disable RawTherapee
ga: Díchumasaigh RawTherapee
th: ปิดการใช้งาน RawTherapee

source: Disable TensorFlow
ga: Díchumasaigh TensorFlow
th: ปิดการใช้งาน TensorFlow

source: Disable Vectors
ga: Díchumasaigh Veicteoirí
th: ปิดการใช้งานเวกเตอร์

source: Disable WebDAV
ga: Díchumasaigh WebDAV
th: ปิดการใช้งาน WebDAV

source: Disables vector graphics support.
ga: Díchumasaigh tacaíocht grafaicí veicteora.
th: ปิดใช้งานการสนับสนุนกราฟิกแบบเวกเตอร์

source: Disables video transcoding and thumbnail extraction.
ga: Díchumasaítear traschódú físeáin agus eastóscadh mionsamhlacha.
th: ปิดใช้งานการแปลงรหัสวิดีโอและการดึงภาพขนาดย่อ

source: Discover
ga: Faigh amach
th: ค้นพบ

source: Dismiss
ga: Díbhe
th: อนุญาตให้ออกไป

source: Display Name
ga: Ainm Taispeána
th: ชื่อที่แสดง

source: Document
ga: Doiciméad
th: เอกสาร

source: Documents
ga: Doiciméid
th: เอกสาร

source: Don't use Darktable to convert RAW images.
ga: Ná húsáid Darktable chun íomhánna RAW a thiontú.
th: อย่าใช้ Darktable เพื่อแปลงไฟล์ RAW

source: Don't use ImageMagick to convert images.
ga: Ná húsáid ImageMagick chun íomhánna a thiontú.
th: อย่าใช้ ImageMagick เพื่อแปลงรูปภาพ

source: Don't use RawTherapee to convert RAW images.
ga: Ná húsáid RawTherapee chun íomhánna RAW a thiontú.
th: อย่าใช้ RawTherapee เพื่อแปลงไฟล์ RAW

source: Donations
ga: Síntiúis
th: บริจาค

source: Done
ga: Déanta
th: เสร็จแล้ว

source: Done.
ga: Déanta.
th: เสร็จแล้ว.

source: Download
ga: Íosluchtaigh
th: ดาวน์โหลด

source: Download only original media files, without any automatically generated files.
ga: Íoslódáil comhaid meán bunaidh amháin, gan aon chomhaid a ghintear go huathoibríoch.
th: ดาวน์โหลดเฉพาะไฟล์มีเดียต้นฉบับ โดยไม่มีไฟล์ที่สร้างขึ้นโดยอัตโนมัติ

source: Download remote files
ga: Íoslódáil comhaid iargúlta
th: ดาวน์โหลดไฟล์ระยะไกล

source: Download single files and zip archives.
ga: Íoslódáil comhaid aonair agus cartlanna zip.
th: ดาวน์โหลดไฟล์เดี่ยวและไฟล์ zip

source: Downloading…
ga: Ag íosluchtú…
th: กำลังดาวน์โหลด…

source: Downscaling Filter
ga: Scagaire Íoslaghdaithe
th: ตัวกรองการลดขนาด

source: Drag and drop files here
ga: Tarraing agus scaoil comhaid anseo
th: ลากและวางไฟล์ที่นี่

source: Due to the high volume of emails we receive, our team may be unable to get back to you immediately.
ga: Mar gheall ar an líon ard ríomhphost a fhaighimid, seans nach mbeidh ár bhfoireann in ann teagmháil a dhéanamh leat láithreach.
th: เนื่องจากเราได้รับอีเมลเป็นจำนวนมาก ทีมงานของเราจึงอาจไม่สามารถติดต่อกลับได้ทันที

source: Duplicates will be skipped and only appear once.
ga: Déanfar dúblaigh a scipeáil agus ní thaispeánfar iad ach uair amháin.
th: รายการที่ซ้ำกันจะถูกข้ามและปรากฏเพียงครั้งเดียว

source: Duration
ga: Fad
th: ระยะเวลา

source: Dynamic Previews
ga: Réamhamhairc Dinimiciúla
th: การแสดงตัวอย่างแบบไดนามิก

source: Dynamic Size Limit: %{n}px
ga: Teorainn Mhéid Dinimiciúla: %{n}px
th: ขีดจำกัดขนาดไดนามิก: %{n}px

source: E-Mail
ga: R-phost
th: อีเมล

source: Edit
ga: Cuir in eagar
th: แก้ไข

source: Edit %{s}
ga: Cuir %{s} in eagar
th: แก้ไข %{s}

source: Edit Account
ga: Cuir Cuntas in Eagar
th: แก้ไขบัญชี

source: Edit Photo
ga: Cuir Grianghraf in Eagar
th: แก้ไขรูปภาพ

source: Edited
ga: Curtha in eagar
th: แก้ไขแล้ว

source: Email
ga: Ríomhphost
th: อีเมล

source: Enable debug mode to display additional logs and help with troubleshooting.
ga: Cumasaigh mód dífhabhtaithe chun logaí breise a thaispeáint agus chun cabhrú le fabhtcheartaithe.
th: เปิดใช้งานโหมดแก้ไขข้อบกพร่องเพื่อแสดงบันทึกเพิ่มเติมและช่วยเหลือในการแก้ปัญหา

source: Enable new features that may be incomplete or unstable.
ga: Cumasaigh gnéithe nua a d'fhéadfadh a bheith neamhiomlán nó éagobhsaí.
th: เปิดใช้งานฟีเจอร์ใหม่ที่อาจไม่สมบูรณ์หรือไม่เสถียร

source: Enables RAW converter presets. May reduce performance.
ga: Cumasaíonn sé réamhshocruithe tiontaire RAW. D'fhéadfadh sé feidhmíocht a laghdú.
th: เปิดใช้งานการตั้งค่าล่วงหน้าของตัวแปลง RAW อาจลดประสิทธิภาพลง

source: Enabling two-factor authentication means that you will need a randomly generated verification code to log in, so even if someone gains access to your password, they will not be able to access your account.
ga: Má chumasaíonn tú fíordheimhniú dhá fhachtóir beidh cód fíorúcháin randamach de dhíth ort chun logáil isteach, mar sin fiú má fhaigheann duine éigin rochtain ar do phasfhocal, ní bheidh siad in ann rochtain a fháil ar do chuntas.
th: การเปิดใช้งานการตรวจสอบสิทธิ์แบบสองปัจจัยหมายความว่าคุณจะต้องใช้รหัสยืนยันที่สร้างขึ้นแบบสุ่มเพื่อเข้าสู่ระบบ ดังนั้นแม้ว่าจะมีคนเข้าถึงรหัสผ่านของคุณ พวกเขาจะไม่สามารถเข้าถึงบัญชีของคุณได้

source: Enter date
ga: Cuir isteach an dáta
th: กรอกวันที่

source: Enter dates
ga: Cuir isteach dátaí
th: ป้อนวันที่

source: Enter the code generated by your authenticator app:
ga: Cuir isteach an cód ginte ag d'aip fíordheimhneora:
th: ป้อนรหัสที่สร้างโดยแอปพลิเคชันการตรวจสอบสิทธิ์ของคุณ:

source: Enter verification code
ga: Cuir isteach cód fíorúcháin
th: ระบุรหัสยืนยืน

source: Enter your password to confirm the action and continue:
ga: Cuir isteach do phasfhocal chun an gníomh a dhearbhú agus lean ar aghaidh:
th: ป้อนรหัสผ่านของคุณเพื่อยืนยันการดำเนินการและดำเนินการต่อ:

source: Error
ga: Earráid
th: ข้อผิดพลาด

source: Errors
ga: Earráidí
th: ข้อผิดพลาด

source: Estimate
ga: Meastachán
th: ประมาณการ

source: Estimate Locations
ga: Suímh Meastacháin
th: สถานที่ประมาณการ

source: Estimate the approximate location of pictures without GPS coordinates.
ga: Déan meastachán ar shuíomh na bpictiúr go garbh gan comhordanáidí GPS.
th: ประมาณตำแหน่งโดยประมาณของรูปภาพโดยปราศจากพิกัด GPS

source: Every two days
ga: Gach dhá lá
th: ทุกสองวัน

source: Exclude content marked as private from search results, shared albums, labels, and places.
ga: Fág amach ábhar atá marcáilte mar phríobháideach ó thorthaí cuardaigh, ó albaim chomhroinnte, ó lipéid agus ó áiteanna.
th: ยกเว้นเนื้อหาที่ทำเครื่องหมายว่าเป็นส่วนตัวจากผลการค้นหา อัลบั้มที่แชร์ ป้ายกำกับ และสถานที่

source: Exclude hidden
ga: Fág i bhfolach
th: ไม่รวมซ่อน

source: ExifTool is required for full support of XMP metadata, videos and Live Photos.
ga: Tá ExifTool ag teastáil chun tacaíocht iomlán a thabhairt do mheiteashonraí, físeáin agus Grianghraif Beo XMP.
th: จำเป็นต้องมีการแยกข้อมูลเมตาด้วย ExifTool เพื่อสนับสนุนวิดีโอเต็มรูปแบบ Live Photo และ XMP

source: Experimental Features
ga: Gnéithe Turgnamhach
th: คุณสมบัติทดลอง

source: Expires
ga: In éag
th: หมดอายุ

source: Exposure
ga: Nochtadh
th: การเปิดรับ
