Repository: lwd-temp/photoprism
Catalog: frontend/src/locales/*.po
Languages: ga, th

source: Extract still images and generate thumbnails while indexing.
ga: Sliocht íomhánna fósta agus mionsamhlacha a ghiniúint agus tú ag innéacsú.
th: สกัดภาพนิ่งและสร้างภาพขนาดย่อในระหว่างการสร้างดัชนี

source: Face
ga: Aghaidh
th: ใบหน้า

source: Faces
ga: Aghaidheanna
th: ใบหน้า

source: Failed removing link
ga: Theip ar bhaint an nasc
th: ลบลิงค์ไม่สำเร็จ

source: Failed to connect account.
ga: Theip ar an gcuntas a nascadh.
th: ไม่สามารถเชื่อมต่อบัญชีได้

source: Failed updating link
ga: Theip ar an nasc a nuashonrú
th: ไม่สามารถอัปเดตลิงก์

source: Family Name
ga: Ainm an Teaghlaigh
th: นามสกุล

source: Fast
ga: Go tapa
th: เร็ว

source: Favorite
ga: is fearr leat
th: ที่ชื่นชอบ

source: Favorites
ga: Ceanáin
th: รายการโปรด

source: Feature Request
ga: Iarratas Gné
th: คำขอคุณสมบัติ

source: Feedback
ga: Aiseolas
th: ข้อเสนอแนะ

source: Female
ga: Mná
th: หญิง

source: File
ga: Comhad
th: ไฟล์

source: File Browser
ga: Brabhsálaí Comhad
th: ไฟล์เบราว์เซอร์

source: File Conversion
ga: Tiontú Comhad
th: การแปลงไฟล์

source: File Name
ga: Ainm an Chomhaid
th: ชื่อไฟล์

source: File Size
ga: Méid an Chomhaid
th: ไฟล์

source: Filename
ga: Ainm comhaid
th: ชื่อไฟล์

source: Files
ga: Comhaid
th: ไฟล์

source: Files with sequential names like 'IMG_1234 (2)' and 'IMG_1234 (3)' belong to the same picture.
ga: Baineann comhaid a bhfuil ainmneacha seicheamhacha orthu mar 'IMG_1234 (2)' agus 'IMG_1234 (3)' leis an bpictiúr céanna.
th: ไฟล์ที่มีชื่อตามลำดับ เช่น 'IMG_1234 (2)' และ 'IMG_1234 (3)' เป็นของรูปภาพเดียวกัน

source: First page
ga: An chéad leathanach
th: หน้าแรก

source: Focal Length
ga: Fad Fócasach
th: ความยาวโฟกัส

source: Folder
ga: Fillteán
th: โฟลเดอร์

source: Folder contains %{n} files
ga: Tá %{n} comhad san fhillteán
th: โฟลเดอร์มี %{n} ไฟล์

source: Folder is empty
ga: Tá an fillteán folamh
th: โฟลเดอร์ว่างเปล่า

source: Folders
ga: Fillteáin
th: โฟลเดอร์

source: Forgot password?
ga: Focal faire dearmadta?
th: ลืมรหัสผ่าน?

source: Frames
ga: Frámaí
th: เฟรม

source: Full Access
ga: Rochtain Iomlán
th: การเข้าถึงแบบเต็ม

source: Fullscreen
ga: Lánscáileán
th: เต็มจอ

source: General
ga: Ginearálta
th: ทั่วไป

source: Generate
ga: Gin
th: สร้าง

source: Generate albums of special moments, journeys, and places.
ga: Gin albaim chuimhneacháin, thurais agus áiteanna speisialta.
th: สร้างอัลบั้มของช่วงเวลาพิเศษ การเดินทาง และสถานที่ต่าง ๆ โดยอัตโนมัติ

source: Generate Previews
ga: Gin Réamhamhairc
th: สร้างการแสดงตัวอย่าง

source: Generated
ga: Gineadh
th: สร้างขึ้น

source: Get Started
ga: Faigh Tosaigh
th: เริ่มต้นใช้งาน

source: Given Name
ga: Ainm tugtha
th: ชื่อจริง

source: Global Options
ga: Roghanna Domhanda
th: ตัวเลือกระดับโลก

source: Go to page {0}
ga: Téigh go leathanach {0}
th: ไปที่หน้า {0}

source: Gold
ga: Óir
th: ทอง

source: Green
ga: Glas
th: สีเขียว

source: Grey
ga: Liath
th: สีเทา

source: Guest
ga: Aoi
th: แขก

source: Hash
ga: Hais
th: กัญชา

source: Help
ga: Cabhrú
th: ช่วย

source: Help & Support
ga: Cabhair & Tacaíocht
th: ช่วยเหลือและสนับสนุน

source: Hidden
ga: i bhfolach
th: ที่ซ่อนอยู่

source: Hidden Files
ga: Comhaid Cheilte
th: ไฟล์ที่ซ่อนอยู่

source: Hide
ga: Folaigh
th: ซ่อน

source: Hide photos that have been moved to archive.
ga: Folaigh grianghraif a cuireadh sa chartlann.
th: ซ่อนรูปภาพที่ถูกย้ายไปเก็บถาวร

source: High
ga: Ard
th: สูง

source: High Dynamic Range (HDR)
ga: Raon Ard Dinimiciúla (HDR)
th: ช่วงไดนามิกสูง (HDR)

source: How can we help?
ga: Conas is féidir linn cabhrú?
th: เราจะช่วยได้อย่างไร?

source: If you lose access to your authenticator app or device, you can use your recovery code to regain access to your account.
ga: Má chailleann tú rochtain ar d'aip nó gléas fíordheimhnitheora, is féidir leat do chód athshlánaithe a úsáid chun rochtain a fháil ar do chuntas arís.
th: หากคุณสูญเสียการเข้าถึงแอปหรืออุปกรณ์ยืนยันตัวตน คุณสามารถใช้รหัสกู้คืนเพื่อเข้าถึงบัญชีของคุณได้อีกครั้ง

source: Image
ga: Íomhá
th: ภาพ

source: Image Quality
ga: Cáilíocht Íomhá
th: คุณภาพของภาพ

source: Import
ga: Iompórtáil
th: นำเข้า

source: Import failed
ga: Theip ar an iompórtáil
th: นำเข้าไม่สำเร็จ

source: Imported files will be sorted by date and given a unique name to avoid duplicates.
ga: Déanfar comhaid iompórtáilte a shórtáil de réir dáta agus tabharfar ainm uathúil dóibh chun dúbailt a sheachaint.
th: ไฟล์ที่นำเข้าจะถูกจัดเรียงตามวันที่และกำหนดชื่อเฉพาะเพื่อหลีกเลี่ยงการซ้ำซ้อน

source: Imported files will be sorted by date and given a unique name.
ga: Déanfar comhaid iompórtáilte a shórtáil de réir dáta agus tabharfar ainm uathúil orthu.
th: ไฟล์ที่นำเข้าจะถูกจัดเรียงตามวันที่และกำหนดชื่อเฉพาะ

source: Importing %{s}…
ga: %{s} á iompórtáil…
th: กำลังนำเข้า %{s}…

source: Importing files to originals…
ga: Comhaid á n-iompórtáil go bunleagan…
th: กำลังนำเข้าไฟล์ไปยังต้นฉบับ…

source: in
ga: isteach
th: ใน

source: In case pictures you expect are missing, please rescan your library and wait until indexing has been completed.
ga: Ar eagla go bhfuil na pictiúir a bhfuil tú ag súil leo in easnamh, déan do leabharlann arís agus fan go dtí go mbeidh an t-innéacsú críochnaithe.
th: ในกรณีที่รูปภาพที่คุณคาดว่าจะหายไป โปรดสแกนไลบรารีของคุณอีกครั้งและรอจนกว่าการจัดทำดัชนีจะเสร็จสมบูรณ์

source: Include RAW image files when downloading stacks and archives.
ga: Cuir comhaid íomhá RAW san áireamh agus stoic agus cartlanna á n-íoslódáil agat.
th: รวมไฟล์ภาพ RAW เมื่อดาวน์โหลดสแต็คและไฟล์เก็บถาวร

source: Include sidecar files when downloading stacks and archives.
ga: Cuir comhaid taobhcharr san áireamh agus stoic agus cartlanna á n-íoslódáil.
th: รวมไฟล์ sidecar เมื่อดาวน์โหลดสแต็คและไฟล์เก็บถาวร

source: Increase storage size or delete files to continue.
ga: Méadaigh méid na stórála nó scrios comhaid chun leanúint ar aghaidh.
th: เพิ่มขนาดพื้นที่เก็บข้อมูลหรือลบไฟล์เพื่อดำเนินการต่อ

source: Index
ga: Innéacs
th: ดัชนี

source: Index and import files through the user interface.
ga: Innéacs agus comhaid a allmhairiú tríd an comhéadan úsáideora.
th: จัดทำดัชนีและนำเข้าไฟล์ผ่านอินเทอร์เฟซผู้ใช้

source: Indexing
ga: Innéacsú
th: การจัดทำดัชนี

source: Indexing failed
ga: Theip ar an innéacsú
th: การจัดทำดัชนีล้มเหลว

source: Indexing media and sidecar files…
ga: Meáin agus comhaid taobhcharr á innéacsú…
th: กำลังสร้างดัชนีสื่อและไฟล์ไซด์คาร์…

source: Instance ID
ga: Aitheantas an Cháis
th: รหัสอินสแตนซ์

source: Insufficient storage.
ga: Stóráil neamhleor
th: พื้นที่เก็บข้อมูลไม่เพียงพอ.

source: Interval
ga: Eatramh
th: ช่วงเวลา

source: Invalid
ga: Neamhbhailí
th: วันที่ไม่ถูกต้อง

source: Invalid address
ga: Seoladh neamhbhailí
th: ที่อยู่ไม่ถูกต้อง

source: Invalid country
ga: Tír neamhbhailí
th: ประเทศไม่ถูกต้อง

source: Invalid date
ga: Dáta neamhbhailí
th: วันที่ไม่ถูกต้อง

source: Invalid parameters
ga: Paraiméadair neamhbhailí
th: วันที่ไม่ถูกต้อง

source: Invalid photo selected
ga: Grianghraf neamhbhailí roghnaithe
th: เลือกรูปภาพไม่ถูกต้อง

source: Invalid time
ga: Am neamhbhailí
th: เวลาไม่ถูกต้อง

source: Invalid URL
ga: URL neamhbhailí
th: URL ไม่ถูกต้อง

source: It is a one-time use code that will disable 2FA for your account when you use it.
ga: Is cód úsáide aonuaire é a dhíchumasóidh 2FA do do chuntas nuair a úsáideann tú é.
th: เป็นรหัสแบบใช้ครั้งเดียวที่จะปิดการใช้งาน 2FA สำหรับบัญชีของคุณเมื่อคุณใช้งาน

source: Item
ga: Mír
th: สิ่งของ

source: Items per page:
ga: Míreanna in aghaidh an leathanaigh:
th: รายการต่อหน้า:

source: JPEG Quality: %{n}
ga: Cáilíocht JPEG: %{n}
th: คุณภาพ JPEG: %{n}

source: JPEG Size Limit: %{n}px
ga: Teorainn Méid JPEG: %{n}px
th: ขีดจำกัดขนาด JPEG: %{n}px

source: JPEGs and thumbnails are automatically rendered as needed.
ga: Déantar JPEG agus mionsamhlacha a rindreáil go huathoibríoch de réir mar is gá.
th: JPEG และภาพขนาดย่อจะแสดงผลโดยอัตโนมัติตามต้องการ

source: Keywords
ga: Eochairfhocail
th: คีย์เวิร์ด

source: Label
ga: Lipéad
th: ฉลาก

source: Labels
ga: Lipéid
th: ป้าย

source: Labels deleted
ga: Scriosadh na lipéid
th: ป้ายกำกับถูกลบ

source: Lanczos: Detail Preservation, Minimal Artifacts
ga: Lanczos: Caomhnú Mionsonraithe, Déantáin Íosráta
th: Lanczos: การเก็บรายละเอียด สิ่งประดิษฐ์น้อยที่สุด

source: Language
ga: Teanga
th: ภาษา

source: Last Active
ga: Gníomhach Deiridh
th: ใช้งานล่าสุด

source: Last Login
ga: Logáil Isteach Deiridh
th: เข้าสู่ระบบครั้งล่าสุด

source: Last page
ga: leathanach deiridh
th: หน้าสุดท้าย

source: Last Sync
ga: Sync Last
th: ซิงค์ล่าสุด

source: Last Used
ga: Úsáidte is déanaí
th: ใช้ล่าสุด

source: Latitude
ga: Domhanleithead
th: ละติจูด

source: LDAP/AD
th: แอลดีเอพี/ค.ศ

source: Learn more
ga: Foghlaim níos mó
th: เรียนรู้เพิ่มเติม

source: Learn More
ga: Foghlaim níos mó
th: เรียนรู้เพิ่มเติม

source: Legal Information
ga: Eolas Dlí
th: ข้อมูลทางกฎหมาย

source: Lens
ga: Lionsa
th: เลนส์

source: Library
ga: Leabharlann
th: ห้องสมุด

source: License
ga: Ceadúnas
th: ใบอนุญาต

source: Like
ga: Cosúil
th: ชอบ

source: Lime
ga: Aoil
th: มะนาว

source: Limit reached, showing first %{n} files
ga: Baineadh an teorainn amach, ag taispeáint na chéad %{n} comhad
th: ถึงขีดจำกัดแล้ว กำลังแสดง %{n} ไฟล์แรก

source: Linear: Very Smooth, Best Performance
ga: Líneach: An-réidh, Feidhmíocht is Fearr
th: เชิงเส้น: ราบรื่นมาก ประสิทธิภาพดีที่สุด

source: Link
ga: Nasc
th: ลิงค์

source: List
ga: Liosta
th: รายการ

source: Live
ga: Beo
th: สด

source: Live Photos
ga: Grianghraif Beo
th: ภาพถ่าย

source: Load more
ga: Luchtaigh níos mó
th: โหลดเพิ่มเติม

source: Loading items...
ga: Míreanna á lódáil...
th: กำลังโหลดรายการ...

source: Loading...
ga: Á lódáil...
th: กำลังโหลด...

source: Local
ga: Áitiúil
th: ท้องถิ่น

source: Local Time
ga: Am Áitiúil
th: เวลาท้องถิ่น

source: Location
ga: Suíomh
th: ที่ตั้ง

source: Log messages appear here whenever PhotoPrism comes across broken files, or there are other potential issues.
ga: Tá teachtaireachtaí logála le feiceáil anseo aon uair a thagann PhotoPrim ar chomhaid briste, nó nuair a bhíonn fadhbanna eile ann.
th: ข้อความบันทึกจะปรากฏที่นี่ทุกครั้งที่ PhotoPrism เจอไฟล์เสีย หรือมีปัญหาอื่นๆ ที่อาจเกิดขึ้น

source: Login
ga: Logáil isteach
th: เข้าสู่ระบบ

source: Logout
ga: Lógó amach
th: ออกจากระบบ

source: Logs
th: บันทึก

source: Longitude
ga: Domhanfhad
th: ลองจิจูด

source: Low
ga: Íseal
th: ต่ำ

source: Low Resolution
ga: Taifeach Íseal
th: ความละเอียดต่ำ

source: Magenta
ga: Mageanta
th: สีม่วงแดง

source: Main Color
ga: Príomh Dath
th: สีหลัก

source: Male
ga: Fireann
th: ชาย

source: Manage Account
ga: Bainistigh Cuntas
th: จัดการบัญชี

source: Manual
ga: Lámhleabhar
th: คู่มือ

source: Manual Upload
ga: Uaslódáil Láimhe
th: อัพโหลดด้วยตนเอง

source: Maps
ga: Léarscáileanna
th: แผนที่

source: Marker
ga: Marcóir
th: เครื่องหมาย

source: Maximum number of accounts has been reached.
ga: Tá uaslíon na gcuntas sroichte.
th: จำนวนบัญชีถึงขีดจำกัดแล้ว

source: Medium
ga: Meánach
th: ปานกลาง

source: Membership
ga: Ballraíocht
th: การเป็นสมาชิก

source: Merge %{a} with %{b}?
ga: An bhfuil fonn ort %{a} a chumasc le %{b}?
th: ผสาน %{a} กับ %{b}?

source: Message sent
ga: Teachtaireacht seolta
th: ส่งข้อความ

source: Metadata
ga: Meiteashonraí
th: ข้อมูลเมตา

source: Metrics
ga: Méadracht
th: เมตริก

source: Minimize
ga: Íoslaghdaigh
th: ย่อเล็กสุด

source: Missing
ga: Ar iarraidh
th: หายไป

source: Missing or invalid configuration
ga: Cumraíocht in easnamh nó cumraíocht neamhbhailí
th: การกำหนดค่าหายไปหรือไม่ถูกต้อง

source: Moments
ga: Chuimhneacháin
th: ช่วงเวลา

source: Monochrome
ga: Monacrómach
th: ขาวดำ

source: Month
ga: Mí
th: เดือน

source: Mosaic
ga: Mósáic
th: โมเสก

source: Most Relevant
ga: Is Ábhartha
th: ที่เกี่ยวข้องมากที่สุด

source: Move Files
ga: Bog Comhaid
th: ย้ายไฟล์

source: Must have at least %{n} characters.
ga: Caithfidh %{n} carachtar ar a laghad a bheith ann.
th: ต้องมีอักขระอย่างน้อย %{n} ตัว

source: Mute
ga: Balbhaigh
th: ปิดเสียง

source: Name
ga: Ainm
th: ชื่อ

source: Name too long
ga: Ainm ró-fhada
th: ชื่อยาวเกินไป

source: Never
ga: Riamh
th: ไม่เคย

source: New
ga: Nua
th: ใหม่

source: New Password
ga: Pasfhocal Nua
th: รหัสผ่านใหม่

source: Newest First
ga: Is Déanaí ar dtús
th: ใหม่ล่าสุดก่อน

source: Next
ga: Ar aghaidh
th: ต่อไป

source: Next page
ga: An chéad leathanach eile
th: หน้าถัดไป

source: Next visual
ga: Amhairc seo chugainn
th: ภาพถัดไป

source: No
ga: Níl
th: ไม่

source: No albums found
ga: Níor aimsíodh albam
th: ไม่พบอัลบั้ม

source: No data available
ga: Níl aon sonraí ar fáil
th: ไม่มีข้อมูล

source: No labels found
ga: Níor aimsíodh aon lipéid
th: ไม่พบป้ายกำกับ

source: No matching records found
ga: Níor aimsíodh aon taifid mheaitseála
th: ไม่พบรายการที่ตรงกัน

source: No more
ga: Níl níos mó
th: ไม่มีอีกต่อไป

source: No people found
ga: Níor aimsíodh daoine
th: ไม่พบผู้คน

source: No pictures found
ga: Níor aimsíodh aon phictiúir
th: ไม่พบรูปภาพ

source: No recently edited pictures
ga: Níl aon phictiúir curtha in eagar le déanaí
th: ไม่มีรูปภาพที่แก้ไขล่าสุด

source: No server connection
ga: Gan nasc freastalaí
th: ไม่มีการเชื่อมต่อกับเซิร์ฟเวอร์

source: No servers configured.
ga: Níl aon fhreastalaí cumraithe.
th: ไม่มีการกำหนดค่าเซิร์ฟเวอร์

source: No services configured.
ga: Níl aon seirbhísí cumraithe.
th: ไม่มีการกำหนดค่าเซิร์ฟเวอร์

source: No thanks
ga: Níl go raibh maith agat
th: ไม่เป็นไรขอบคุณ

source: No warnings or error containing this keyword. Note that search is case-sensitive.
ga: Níl aon rabhadh nó earráid ina bhfuil an eochairfhocal seo. Tabhair faoi deara go bhfuil an cuardach cás-íogair.
th: ไม่มีคำเตือนหรือข้อผิดพลาดที่มีคีย์เวิร์ดนี้ โปรดทราบว่าการค้นหาคำนึงถึงตัวพิมพ์เล็กและตัวพิมพ์ใหญ่

source: Non-photographic and low-quality images require a review before they appear in search results.
ga: Teastaíonn athbhreithniú ar íomhánna nach bhfuil grianghrafadóireachta agus ar cháilíocht íseal sula bhfeictear iad i dtorthaí cuardaigh.
th: รูปภาพที่ไม่ใช่ภาพถ่ายและคุณภาพต่ำต้องได้รับการตรวจสอบก่อนที่จะปรากฏในผลการค้นหา

source: None
ga: Dada
th: ไม่มี

source: Not allowed
ga: Ní cheadaítear
th: ไม่อนุญาต

source: Not found
ga: Ní bhfuarthas
th: ไม่พบ

source: Not sorted.
ga: Gan sórtáilte.
th: ไม่ได้จัดเรียง

source: Not supported
ga: Ní thacaítear leis
th: ไม่รองรับ

source: Note you may manually manage your originals folder and importing is optional.
ga: Tabhair faoi deara gur féidir leat d’fhillteán bunleagan a bhainistiú de láimh agus go bhfuil sé roghnach iompórtáil.
th: โปรดทราบว่าคุณสามารถจัดการโฟลเดอร์ต้นฉบับของคุณได้ด้วยตนเอง และการนำเข้าเป็นทางเลือก

source: Note:
ga: Nóta:
th: บันทึก:

source: Note: Only WebDAV servers, like Nextcloud or PhotoPrism, can be configured as remote service for backup and file upload.
ga: Nóta: Ní féidir ach freastalaithe WebDAV, cosúil le Nextcloud nó PhotoPrim, a chumrú mar chianseirbhís le haghaidh cúltaca agus uaslódáil comhad.
th: หมายเหตุ: เฉพาะเซิร์ฟเวอร์ WebDAV เช่น Nextcloud หรือ PhotoPrism เท่านั้นที่สามารถกำหนดค่าเป็นบริการระยะไกลสำหรับการสำรองข้อมูลและการอัปโหลดไฟล์

source: Notes
ga: Nótaí
th: หมายเหตุ

source: Nothing to see here yet.
ga: Níl faic le feiceáil anseo fós.
th: ยังไม่มีอะไรให้ดูที่นี่ อดทน

source: Nothing was found.
ga: Ní bhfuarthas aon rud.
th: ไม่พบสิ่งใด

source: OIDC
th: คปภ

source: OK
ga: ceart go leor
th: ตกลง

source: Oldest First
ga: Is sine ar dtús
th: เก่าสุดก่อน

source: On Windows, enter the following resource in the connection dialog:
ga: Ar Windows, cuir isteach an acmhainn seo a leanas sa dialóg naisc:
th: บน Windows ให้ป้อนทรัพยากรต่อไปนี้ในกล่องโต้ตอบการเชื่อมต่อ:

source: On-demand generation of thumbnails may cause high CPU and memory usage. It is not recommended for resource-constrained servers and NAS devices.
ga: D'fhéadfadh úsáid ard LAP agus cuimhne a bheith mar chúis le giniúint mionsamhlacha ar éileamh. Ní mholtar é do fhreastalaithe teoranta ó thaobh acmhainní agus feistí NAS.
th: การสร้างภาพขนาดย่อตามความต้องการอาจทำให้มีการใช้งาน CPU และหน่วยความจำสูง ไม่แนะนำสำหรับเซิร์ฟเวอร์และอุปกรณ์ NAS ที่จำกัดทรัพยากร

source: Once a week
ga: Uair sa tseachtain
th: สัปดาห์ละครั้ง

source: One album found
ga: Aimsíodh albam amháin
th: พบหนึ่งอัลบั้ม

source: One file found
ga: Fuarthas comhad amháin
th: พบหนึ่งไฟล์

source: One file uploaded
ga: Uaslódáladh comhad amháin
th: อัปโหลดแล้วหนึ่งไฟล์

source: One folder found
ga: Fuarthas fillteán amháin
th: พบหนึ่งโฟลเดอร์

source: One label found
ga: Fuarthas lipéad amháin
th: พบหนึ่งป้าย

source: One person found
ga: Fuair duine amháin
th: พบหนึ่งคน

source: One picture found
ga: Fuarthas pictiúr amháin
th: พบหนึ่งภาพ

source: Only locally managed accounts can be set up for authentication with 2FA.
ga: Ní féidir ach cuntais a bhainistítear go háitiúil a bhunú le haghaidh fíordheimhnithe le 2FA.
th: เฉพาะบัญชีที่จัดการภายในเครื่องเท่านั้นที่สามารถตั้งค่าสำหรับการตรวจสอบสิทธิ์ด้วย 2FA ได้

source: Open
ga: Oscail
th: เปิด

source: optional
ga: roghnach
th: ไม่จำเป็น

source: or
ga: nó
th: หรือ

source: Orange
ga: Oráiste
th: ส้ม

source: Organization
ga: Eagraíocht
th: ปฐมนิเทศ

source: Orientation
ga: Treoshuíomh
th: ปฐมนิเทศ

source: Original file names will be stored and indexed.
ga: Déanfar bunainmneacha na gcomhad a stóráil agus a innéacsú.
th: ชื่อไฟล์ต้นฉบับจะถูกจัดเก็บและจัดทำดัชนี

source: Original Name
ga: Ainm Bunaidh
th: ชื่อจริง

source: Originals
ga: Bunábhair
th: ต้นฉบับ

source: Other
ga: Eile
th: อื่น

source: Our mission is to provide the most user- and privacy-friendly solution to keep your pictures organized and accessible.
ga: Is é an misean atá againn ná an réiteach is cairdiúla don úsáideoir agus don phríobháideacht a sholáthar chun do phictiúr a choinneáil eagraithe agus inrochtana.
th: ภารกิจของเราคือการจัดหาโซลูชันที่เป็นมิตรต่อผู้ใช้และความเป็นส่วนตัวมากที่สุด เพื่อให้รูปภาพของคุณเป็นระเบียบและเข้าถึงได้

source: Outdoor
ga: Amuigh faoin aer
th: กลางแจ้ง

source: Page {0}, Current page
ga: Leathanach {0}, leathanach reatha
th: หน้า {0}, หน้าปัจจุบัน

source: Pages
ga: Leathanaigh
th: หน้า

source: Pagination Navigation
ga: Nascleanúint Leathanaigh
th: การนำทางการแบ่งหน้า

source: Panorama
ga: Lánléargas
th: พาโนรามา

source: Panoramas
ga: Lánléargas
th: พาโนรามา

source: Password
ga: Pasfhocal
th: รหัสผ่าน

source: Password changed
ga: Athraíodh an pasfhocal
th: รหัสผ่านเปลี่ยน

source: People
ga: Daoine
th: ประชากร

source: People you share a link with will be able to view public contents.
ga: Beidh daoine a roinneann tú nasc leo in ann féachaint ar inneachar poiblí.
th: คนที่คุณแชร์ลิงก์ด้วยจะสามารถดูเนื้อหาสาธารณะได้

source: Permanently deleted
ga: Scriosta go buan
th: ลบอย่างถาวร

source: Permanently remove files to free up storage.
ga: Bain comhaid go buan chun stóráil a shaoradh.
th: ลบไฟล์อย่างถาวรเพื่อเพิ่มพื้นที่จัดเก็บ

source: Person
ga: Duine
th: บุคคล

source: Personal
ga: Pearsanta
th: ส่วนตัว

source: Photo
ga: Grianghraf
th: รูปถ่าย

source: PhotoPrism is 100% self-funded and independent.
ga: Tá PhotoPrism 100% féinmhaoinithe agus neamhspleách.
th: PhotoPrism ใช้เงินตัวเอง 100% และเป็นอิสระ

source: PhotoPrism+ Membership
ga: Ballraíocht PhotoPrism+
th: PhotoPrism+ การเป็นสมาชิก

source: Photos
ga: Grianghraif
th: ภาพถ่าย

source: Picture Title
ga: Teideal Pictiúr
th: ชื่อภาพ

source: Pink
ga: Bándearg
th: สีชมพู

source: Place
ga: Áit
th: สถานที่

source: Place & Time
ga: Áit & Am
th: สถานที่และเวลา

source: Places
ga: Áiteanna
th: สถานที่

source: Please confirm your new password.
ga: Deimhnigh do phasfhocal nua le do thoil.
th: กรุณายืนยันรหัสผ่านใหม่ของคุณ

source: Please copy the following randomly generated app password and keep it in a safe place, as you will not be able to see it again:
ga: Cóipeáil an pasfhocal aipe a gineadh go randamach agus coinnigh in áit shábháilte é, mar ní bheidh tú in ann é a fheiceáil arís:
th: โปรดคัดลอกรหัสผ่านสำหรับแอปที่สร้างขึ้นแบบสุ่มต่อไปนี้และเก็บไว้ในที่ปลอดภัย เนื่องจากคุณจะไม่สามารถดูได้อีก:

source: Please do not upload any private, unlawful or offensive pictures.
ga: Ná huaslódáil aon pictiúir phríobháideacha, neamhdhleathacha nó maslacha.
th: กรุณาอย่าอัพโหลดภาพส่วนตัว ผิดกฎหมาย หรือไม่เหมาะสม

source: Please don't upload photos containing offensive content.
ga: Ná huaslódáil grianghraif a bhfuil ábhar maslach iontu.
th: กรุณาอย่าอัปโหลดรูปภาพที่มีเนื้อหาที่ไม่เหมาะสม

source: Please enter OTP character {0}
ga: Cuir isteach carachtar OTP {0}
th: กรุณากรอกรหัส OTP {0}

source: Please note that changing your password will log you out on other devices and browsers.
ga: Tabhair faoi deara le do thoil go ndéanfaidh athrú ar do phasfhocal tú a logáil amach ar ghléasanna agus brabhsálaithe eile.
th: โปรดทราบว่าการเปลี่ยนรหัสผ่านจะทำให้คุณออกจากระบบบนอุปกรณ์และเบราว์เซอร์อื่นๆ

source: Please restart your instance for the changes to take effect.
ga: Atosaigh do chás le go dtiocfaidh na hathruithe i bhfeidhm.
th: โปรดรีสตาร์ทอินสแตนซ์ของคุณเพื่อให้การเปลี่ยนแปลงมีผล

source: Please wait…
ga: Fan le do thoil…
th: โปรดรอ…

source: PM
th: นายกฯ

source: PNG Size Limit: %{n}px
ga: Teorainn Méid PNG: %{n}px
th: ขีดจำกัดขนาด PNG: %{n}px

source: Portrait
ga: Portráid
th: ภาพเหมือน

source: Preserve filenames
ga: Caomhnaigh ainmneacha comhaid
th: รักษาชื่อไฟล์

source: Press enter to create a new album.
ga: Brúigh Enter chun albam nua a chruthú.
th: กด Enter เพื่อสร้างอัลบั้มใหม่

source: Prevent database and album backups as well as YAML sidecar files from being created.
ga: Cosc a chur le cúltacaí bunachar sonraí agus albam chomh maith le comhaid taobhcharr YAML ó bheith cruthaithe.
th: ป้องกันการสำรองข้อมูลฐานข้อมูลและอัลบั้ม รวมถึงไฟล์ช่วยเหลือ YAML ไม่ให้ถูกสร้างขึ้น

source: Prevent other apps from accessing PhotoPrism as a shared network drive.
ga: Cosc a chur ar aipeanna eile rochtain a fháil ar PhotoPrim mar thiomántán líonra roinnte.
th: ป้องกันไม่ให้แอปอื่นเข้าถึง PhotoPrism เป็นไดรฟ์เครือข่ายที่ใช้ร่วมกัน

source: Preview
ga: Réamhamharc
th: ดูตัวอย่าง

source: Preview Images
ga: Íomhánna Réamhamhairc
th: ดูตัวอย่างรูปภาพ

source: Previous
ga: Roimhe Seo
th: ก่อนหน้า

source: Previous page
ga: An leathanach roimhe seo
th: หน้าก่อน

source: Previous visual
ga: Amhairc roimhe seo
th: ภาพก่อนหน้า

source: Primary
ga: Bunscoile
th: หลัก

source: Private
ga: Príobháideach
th: ส่วนตัว

source: Product Feedback
ga: Aiseolas Táirge
th: คำติชมสินค้า

source: Projection
ga: Teilgean
th: การฉายภาพ

source: Purple
ga: Corcra
th: สีม่วง

source: Quality Filter
ga: Scagaire Cáilíochta
th: ตัวกรองคุณภาพ

source: Quality Score
ga: Scór Cáilíochta
th: คะแนนคุณภาพ

source: r
th: ร

source: Random
ga: randamach
th: สุ่ม

source: Rating {0} of {1}
ga: Rátáil {0} de {1}
th: คะแนน {0} จาก {1}

source: Raw
ga: amh
th: ดิบ

source: RAW
th: ดิบ

source: Re-index all originals, including already indexed and unchanged files.
ga: Déan gach bunleagan a athinnéacsú, lena n-áirítear comhaid atá innéacsaithe cheana féin agus nach bhfuil aon athrú orthu.
th: จัดทำดัชนีต้นฉบับทั้งหมดใหม่ รวมทั้งไฟล์ที่จัดทำดัชนีแล้วและไม่เปลี่ยนแปลง

source: Read-Only Mode
ga: Mód Inléite Amháin
th: โหมดอ่านอย่างเดียว

source: Recently Added
ga: Curtha leis le déanaí
th: เพิ่มมาเร็ว ๆ นี้

source: Recently Archived
ga: Cartlannaithe le déanaí
th: เก็บถาวรเมื่อเร็วๆ นี้

source: Recently Edited
ga: Curtha in eagar le déanaí
th: แก้ไขล่าสุด

source: Recognition starts after indexing has been completed.
ga: Tosaíonn an t-aitheantas tar éis don innéacsú a bheith críochnaithe.
th: การรับรู้เริ่มต้นหลังจากการจัดทำดัชนีเสร็จสิ้น

source: Recognize faces so people can be assigned and found.
ga: Aithnigh aghaidheanna ionas gur féidir daoine a shannadh agus a fháil.
th: จดจำใบหน้าเพื่อให้สามารถค้นหาบุคคลที่เฉพาะเจาะจงได้

source: Recognized
ga: Aitheanta
th: ได้รับการยอมรับ

source: Recovery Code
ga: Cód Aisghabháil
th: รหัสการกู้คืน

source: Red
ga: Dearg
th: สีแดง

source: Refresh
ga: Athnuaigh
th: รีเฟรช

source: Regions
ga: Réigiúin
th: ภูมิภาค

source: Register
ga: Clár
th: ลงทะเบียน

source: Reload
ga: Athlódáil
th: โหลดซ้ำ
